[
  {
    "id": "genai_marketing_pdf_01",
    "type": "page",
    "deck_name": "Generative AI in Marketing: Concepts, Tools & Hands-On Workflows",
    "title": "Generative AI in Marketing: Concepts, Tools & Hands-On Workflows",
    "url": "genai_marketing",
    "slide_id": 1,
    "what": "Title slide introducing the course on Generative AI in Marketing. It sets the scope of the session, covering core concepts, practical tools, and hands-on workflows marketers will use to apply GenAI in real-world scenarios."
  },
  {
    "id": "genai_marketing_pdf_02",
    "type": "page",
    "deck_name": "Generative AI in Marketing: Concepts, Tools & Hands-On Workflows",
    "title": "Gen AI Landscape for Marketing",
    "url": "genai_marketing",
    "slide_id": 2,
    "what": "Explains the Generative AI landscape for marketing, covering foundation models, fine-tuned models, and application-layer AI. It also maps GenAI use cases across the marketing funnel from awareness to retention and highlights commonly used tools like ChatGPT, Midjourney, and Runway."
  },
  {
    "id": "genai_marketing_pdf_03",
    "type": "page",
    "deck_name": "Generative AI in Marketing: Concepts, Tools & Hands-On Workflows",
    "title": "Using LLMs (ChatGPT / Claude) for Marketing Content",
    "url": "genai_marketing",
    "slide_id": 3,
    "what": "Describes how large language models like ChatGPT and Claude are used for marketing content creation. The slide explains strengths such as creativity, speed, and adaptability, outlines common risks like hallucinations and bias, and provides a step-by-step guide for effective usage in ad copy, emails, and website content."
  },
  {
    "id": "genai_marketing_pdf_04",
    "type": "page",
    "deck_name": "Generative AI in Marketing: Concepts, Tools & Hands-On Workflows",
    "title": "Transformer & Attention: Why AI Understands Context",
    "url": "genai_marketing",
    "slide_id": 4,
    "what": "Explains the transformer architecture and attention mechanism that power modern LLMs. It covers how attention helps models understand context, the role of encoders and decoders, and why this matters for marketers when crafting better prompts and troubleshooting AI outputs."
  },
  {
    "id": "genai_marketing_pdf_05",
    "type": "page",
    "deck_name": "Generative AI in Marketing: Concepts, Tools & Hands-On Workflows",
    "title": "RAG, Perplexity & Accuracy in Marketing",
    "url": "genai_marketing",
    "slide_id": 5,
    "what": "Covers why LLMs hallucinate and how Retrieval-Augmented Generation (RAG) improves accuracy by grounding responses in external data. The slide explains perplexity, how to apply it for validation, and marketing use cases such as policy pages, competitive research, and market trend analysis."
  },
  {
    "id": "genai_marketing_pdf_06",
    "type": "page",
    "deck_name": "Generative AI in Marketing: Concepts, Tools & Hands-On Workflows",
    "title": "Prompt Engineering as a Core Marketing Skill",
    "url": "genai_marketing",
    "slide_id": 6,
    "what": "Introduces prompt engineering as a critical marketing skill. It outlines the core components of effective prompts including role, objective, context, constraints, and output format, and shows how structured prompting leads to better, goal-aligned AI outputs."
  },
  {
    "id": "genai_marketing_pdf_07",
    "type": "page",
    "deck_name": "Generative AI in Marketing: Concepts, Tools & Hands-On Workflows",
    "title": "Gen AI for Performance Marketing & Growth",
    "url": "genai_marketing",
    "slide_id": 7,
    "what": "Explains how Generative AI accelerates performance marketing by enabling rapid creative experimentation. The slide compares generative and predictive AI, shows how marketers generate and test variants, and highlights applications across ads, SEO, and CRO with human review emphasized."
  },
  {
    "id": "genai_marketing_pdf_08",
    "type": "page",
    "deck_name": "Generative AI in Marketing: Concepts, Tools & Hands-On Workflows",
    "title": "Creating Marketing Videos Using Gen AI",
    "url": "genai_marketing",
    "slide_id": 8,
    "what": "Explains how GenAI is transforming video creation. It compares traditional and AI-assisted workflows, outlines types of AI-generated videos, provides a step-by-step creation process, and highlights marketing use cases such as social ads, explainers, and internal communications."
  },
  {
    "id": "genai_marketing_pdf_09",
    "type": "page",
    "deck_name": "Generative AI in Marketing: Concepts, Tools & Hands-On Workflows",
    "title": "AI-Generated Voice & Music for Branding",
    "url": "genai_marketing",
    "slide_id": 9,
    "what": "Describes how Generative AI creates synthetic voices and music for branding. The slide covers voice synthesis, voice cloning, music generation, associated risks like copyright and authenticity, and marketing use cases including brand jingles, video voiceovers, and podcast intros."
  },
  {
    "id": "genai_marketing_pdf_10",
    "type": "page",
    "deck_name": "Generative AI in Marketing: Concepts, Tools & Hands-On Workflows",
    "title": "Course Grading, Participation & How to Score an A",
    "url": "genai_marketing",
    "slide_id": 10,
    "what": "Explains the course evaluation criteria, emphasizing hands-on application over exams. It outlines expectations for individual work, group collaboration, creativity, and experimentation, and explains the grading ladder and key message of learning by building and testing."
  }
]
