[
  {
    "id": "idea_to_screen_pdf_01",
    "type": "page",
    "deck_name": "Play: From Idea to Screen 🪄",
    "title": "Play: From Idea to Screen 🪄",
    "url": "idea_to_screen",
    "slide_id": 1,
    "what": "Opening and title slide for the module 'Play: From Idea to Screen'. This slide introduces the overall journey of converting a creative idea into a finished video using AI tools, setting expectations for hands-on learning and experimentation."
  },
  {
    "id": "idea_to_screen_pdf_02",
    "type": "page",
    "deck_name": "Play: From Idea to Screen 🪄",
    "title": "Play: Lights. Camera. Prompt.",
    "url": "idea_to_screen",
    "slide_id": 2,
    "what": "This slide introduces the concept of prompt-driven video creation. It explains how writing clear, descriptive text prompts can act like a script or director’s instructions, allowing AI tools to generate cinematic video content from words alone."
  },
  {
    "id": "idea_to_screen_pdf_03",
    "type": "page",
    "deck_name": "Play: From Idea to Screen 🪄",
    "title": "Viki as 1890’s portrait hanging in Dracula",
    "url": "idea_to_screen",
    "slide_id": 3,
    "what": "A detailed example of an AI video prompt showing how rich descriptions influence output quality. The slide describes a character emerging from an ornate 1890s portrait in a gothic setting, along with specific music cues, demonstrating how visual and audio prompts work together."
  },
  {
    "id": "idea_to_screen_pdf_04",
    "type": "page",
    "deck_name": "Play: From Idea to Screen 🪄",
    "title": "Play: Optimize with Clipchamp",
    "url": "idea_to_screen",
    "slide_id": 4,
    "what": "This slide introduces Microsoft Clipchamp as a post-generation optimization tool. It focuses on how AI-generated videos can be refined through trimming, formatting, resizing, and adding final edits to make them suitable for marketing or social platforms."
  },
  {
    "id": "idea_to_screen_pdf_05",
    "type": "page",
    "deck_name": "Play: From Idea to Screen 🪄",
    "title": "Play: Edit with Descript",
    "url": "idea_to_screen",
    "slide_id": 5,
    "what": "Explains Descript’s unique text-based approach to video editing, where users can modify video content simply by editing the transcript. The slide highlights how this simplifies editing for non-technical users."
  },
  {
    "id": "idea_to_screen_pdf_06",
    "type": "page",
    "deck_name": "Play: From Idea to Screen 🪄",
    "title": "How does it work? (Descript)",
    "url": "idea_to_screen",
    "slide_id": 6,
    "what": "This slide breaks down the AI technologies behind Descript, including speech-to-text models, natural language processing, generative AI for voice cloning or overdubbing, and computer vision for understanding video scenes."
  },
  {
    "id": "idea_to_screen_pdf_07",
    "type": "page",
    "deck_name": "Play: From Idea to Screen 🪄",
    "title": "Play: A Puppy Pizza?",
    "url": "idea_to_screen",
    "slide_id": 7,
    "what": "A playful and creative example demonstrating the imaginative possibilities of AI video generation. This slide shows how unconventional or humorous prompts can still produce coherent and engaging video outputs."
  },
  {
    "id": "idea_to_screen_pdf_08",
    "type": "page",
    "deck_name": "Play: From Idea to Screen 🪄",
    "title": "Play: Work with a Parallel Video RAG",
    "url": "idea_to_screen",
    "slide_id": 8,
    "what": "A practical, hands-on exercise using Invideo AI to generate a video about India’s construction sector. The slide guides users through prompt writing, choosing a video format, and editing the generated script and visuals."
  },
  {
    "id": "idea_to_screen_pdf_09",
    "type": "page",
    "deck_name": "Play: From Idea to Screen 🪄",
    "title": "What Happens in Invideo v2.0?",
    "url": "idea_to_screen",
    "slide_id": 9,
    "what": "Explains the Parallel Retrieval-Augmented Generation process used in Invideo v2.0, where relevant stock video clips and background music are retrieved or generated simultaneously to match the script’s context and tone."
  },
  {
    "id": "idea_to_screen_pdf_10",
    "type": "page",
    "deck_name": "Play: From Idea to Screen 🪄",
    "title": "Explore: Use AI to learn about AI",
    "url": "idea_to_screen",
    "slide_id": 10,
    "what": "Closing slide encouraging learners to use AI tools to further explore AI concepts themselves, such as summarizing content, asking questions, and learning interactively, supported by a QR code for continued engagement."
  }
]
